
#! ---------------------------------------------------------
# range(10)              => range(0, 10)
# list(range(10))        => [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# range(10, 20)    #     => range(10, 20)
# range(10, 20, 2) #     => range(10, 20, 2)
# list(range(10, 20, 2)) => [10, 12, 14, 16, 18]
#! ---------------------------------------------------------
# for (let i=0; i<10; i++) {}
# for num in range(10):
#     print(num)
#     # num = num + 1
#     num += 1
# typeof([])        =>  object
# print(type([]))   =>  <class 'list'>
#! ---------------------------------------------------------
# UPDATE
# x_list[...:...] = [...]   =>  updates from ... to ... by [...]
#! ---------------------------------------------------------
# ADD
# [].insert(position, element_to_add) => вставлять
# [].append()  =>  добавит элемент в конец листа
# [].extend()  =>  добавит элементы в конец листа
#! ---------------------------------------------------------
# REMOVE
# "..." in x  =>  проверяет есть ли элемент в листе
# [].pop()     =>  удаляет последний элемент
# [].remove()  =>  удаляет элемент по значению
#! ---------------------------------------------------------
# COPY
# [].copy() => копирует лист
#! ---------------------------------------------------------
# SORT
# [].sort(reverse=True)  => меняет оригинальный лист
# sorted([])             => не меняет оригинальный лист 
#                  и можно присвоить новой переменной
#! ---------------------------------------------------------
# REVERSE
# [].reverse() =>  меняет оригинальный лист
#! ---------------------------------------------------------


answer = input("Введите пять чисел и разделите их запятой (,):  ")

def multiply(arg):
    arr = arg.split(",")
    result = 1
    for num in arr:
        result *= int(num)
    return result

print(multiply(answer))