
#! MODIFYING STRINGS

#* capitalize()      Converts the first character to upper case
#*               RU: преобразует первый символ в верхний регистр
#!-------------------------------------------------------------------------------------------
#* title()          Converts the first character of each word to upper case
#*               RU: преобразует первый символ каждого слова в верхний регистр
#!-------------------------------------------------------------------------------------------
#* istitle()          Returns True if the string follows the rules of a title
#*               RU: Возвращает True, если строка соответствует правилам заголовка
#!-------------------------------------------------------------------------------------------
#* upper()          Converts a string into upper case
#*               RU: преобразует строку в верхний регистр
#!-------------------------------------------------------------------------------------------
#* lower()          Converts a string into lower case
#*               RU: преобразует строку в нижний регистр
#!-------------------------------------------------------------------------------------------
#* casefold()      Converts string into lower case
#*               RU: преобразует строку в нижний регистр
#!-------------------------------------------------------------------------------------------
#* isupper()          Returns True if all characters in the string are upper case
#*               RU: Возвращает True, если все символы в строке в верхнем регистре
#!-------------------------------------------------------------------------------------------
#* islower()          Returns True if all characters in the string are lower case
#*               RU: Возвращает True, если все символы в строке в нижнем регистре
#!-------------------------------------------------------------------------------------------
#* center()          Returns a centered string
#*               RU: Возвращает центрированную строку
#!-------------------------------------------------------------------------------------------
#* count()          Returns the number of times a specified value occurs in a string
#*               RU: Возвращает количество раз, когда в строке встречается указанное значение
#!-------------------------------------------------------------------------------------------
#* endswith()      Returns true if the string ends with the specified value
#*               RU: Возвращает true, если строка заканчивается указанным значением
#!-------------------------------------------------------------------------------------------
#* startswith()      Returns true if the string starts with the specified value
#*               RU: Возвращает true, если строка начинается с указанного значения
#!-------------------------------------------------------------------------------------------
#* expandtabs()      Sets the tab size of the string  (EX:  "H\te\tl\tl\to" ==>  "H    e    l    l    o")
#*               RU: Устанавливает размер табуляции строки 
#!-------------------------------------------------------------------------------------------
#* find()          Searches the string for a specified value and returns the position of where it was found (==> .indexOf())
#*               RU: Ищет строку для указанного значения и возвращает позицию, где оно было найдено
#!-------------------------------------------------------------------------------------------
#* rfind()          Searches the string for a specified value and returns the last position of where it was found  (==> .lastIndexOf()
#*               RU: Ищет строку для указанного значения и возвращает последнюю позицию, где оно было найдено
#!-------------------------------------------------------------------------------------------
#* index()          Searches the string for a specified value and returns the position of where it was found (==> .indexOf())
#*               RU: Ищет строку для указанного значения и возвращает позицию, где оно было найдено
#!-------------------------------------------------------------------------------------------
#* swapcase()      Swaps cases, lower case becomes upper case and vice versa
#*               RU: Меняет регистр, нижний регистр становится верхним и наоборот
#!-------------------------------------------------------------------------------------------
#* format()          Formats specified values in a string
#*               RU: Форматирует указанные значения в строке
#!-------------------------------------------------------------------------------------------